InformationRegisters/ИзменениеСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИзменениеСотрудника</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВедущийКонструктор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дизайнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Замерщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиПроекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПроекта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерНастройки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПриемНаРаботу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПриемНаРаботу</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Работает</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Подразделения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Подразделения</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеАктивное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСтрокиТаблицы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/Должности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Должности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВедущийКонструктор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дизайнер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Замерщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Конструктор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Менеджер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Композиции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Композиции</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГабаритныйЧертеж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГабаритныеЧертежи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конструктор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеПомещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/омСотрудники/Ext/Module.bsl
Функция ПолучитьТекущегоСотрудника() Экспорт

	Возврат ПараметрыСеанса.ТекущийПользователь.Сотрудник;
	
КонецФункции // ПолучитьТекущегоСотрудника()

Функция ПолучитьТекущегоПользователя(НаименованиеПользователя = Ложь, НаименованиеИСсылка = Ложь) Экспорт
	
	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	
	Если НаименованиеИСсылка Тогда
	
		Возврат Новый Структура("ТекущийПользователь, Наименование", ТекущийПользователь, ТекущийПользователь.Наименование);	
	
	КонецЕсли;
	
	Если НаименованиеПользователя Тогда
		Возврат ТекущийПользователь.Наименование;
	КонецЕсли;
	
	Возврат ТекущийПользователь;
	
КонецФункции // ПолучитьТекущегоПользователя()

// Если ВозвратВТаблице истина, то всегда возвращается таблица значений,
//если ложь, 
//	то тогда если мСотрудники массив возвращается массив структур,
//	если элемент справочника, то структура
Функция ПолучитьКонтактыСотрудников(мСотрудники, ВозвратВТаблице = Ложь) Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СотрудникиКонтактнаяИнформация.Ссылка КАК Сотрудник,
		|	СотрудникиКонтактнаяИнформация.АдресЭП КАК АдресЭП,
		|	СотрудникиКонтактнаяИнформация.НомерТелефона КАК НомерТелефона
		|ИЗ
		|	Справочник.Сотрудники.КонтактнаяИнформация КАК СотрудникиКонтактнаяИнформация
		|ГДЕ
		|	СотрудникиКонтактнаяИнформация.Ссылка В(&мСотрудники)
		|	И СотрудникиКонтактнаяИнформация.Тип В(&Тип)";
	
	Запрос.УстановитьПараметр("мСотрудники", мСотрудники);
	Запрос.УстановитьПараметр("Тип", ПолучитьТипыКонтактнойИнформации());
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если ВозвратВТаблице Тогда
	
		ДанныеВозврата = Новый ТаблицаЗначений;
		
		ДанныеВозврата.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
		ДанныеВозврата.Колонки.Добавить("АдресЭП", Новый ОписаниеТипов("Строка"));
		ДанныеВозврата.Колонки.Добавить("НомерТелефона", Новый ОписаниеТипов("Строка"));
	
	Иначе
		Если ТипЗнч(мСотрудники) = Тип("Массив") Тогда
			ВозвратВМассиве = Истина;
			
			ДанныеВозврата = Новый Массив;
		Иначе
			ВозвратВМассиве = Ложь;
			
			ДанныеВозврата = Новый Структура("АдресЭП,НомерТелефона","","");
		КонецЕсли;
	КонецЕсли;
	
	
	Пока Выборка.Следующий() Цикл
		Если ВозвратВТаблице Тогда
			НайденаяСтрока = ДанныеВозврата.Найти(Выборка.Сотрудник, "Сотрудник");
			
			Если НайденаяСтрока = Неопределено Тогда
				ЗаполнитьЗначенияСвойств(ДанныеВозврата.Добавить(), Выборка);
			Иначе	
				Если НЕ ПустаяСтрока(Выборка.АдресЭП) Тогда
					НайденаяСтрока.АдресЭП 			= Выборка.АдресЭП;
				КонецЕсли;	
				Если НЕ ПустаяСтрока(Выборка.НомерТелефона) Тогда
					НайденаяСтрока.НомерТелефона 	= Выборка.НомерТелефона;
				КонецЕсли;	
			КонецЕсли;

		Иначе
			
			Если ВозвратВМассиве Тогда
				СотрудникУжеСуществует = Ложь;
				
				Для каждого текСтруктура Из ДанныеВозврата Цикл
					Если текСтруктура.Сотрудник = Выборка.Сотрудник Тогда
						Если НЕ ПустаяСтрока(Выборка.АдресЭП) Тогда
							текСтруктура.АдресЭП 			= Выборка.АдресЭП;
						КонецЕсли;	
						Если НЕ ПустаяСтрока(Выборка.НомерТелефона) Тогда
							текСтруктура.НомерТелефона 	= Выборка.НомерТелефона;
						КонецЕсли;	
					КонецЕсли;
					СотрудникУжеСуществует = Истина;
				КонецЦикла; 
				
				Если НЕ СотрудникУжеСуществует Тогда
					стДанные = Новый Структура("АдресЭП,НомерТелефона,Сотрудник","","");
					ЗаполнитьЗначенияСвойств(стДанные, Выборка);
					ДанныеВозврата.Добавить(стДанные);
				КонецЕсли;
			Иначе
				Если НЕ ПустаяСтрока(Выборка.АдресЭП) Тогда
					ДанныеВозврата.АдресЭП 			= Выборка.АдресЭП;
				КонецЕсли;	
				Если НЕ ПустаяСтрока(Выборка.НомерТелефона) Тогда
					ДанныеВозврата.НомерТелефона 	= Выборка.НомерТелефона;
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ДанныеВозврата; 
КонецФункции // ПолучитьКонтактыСотрудников()

Функция ПолучитьТипыКонтактнойИнформации() Экспорт

	мТипыИнформации = Новый Массив(2);
	
	мТипыИнформации[0] = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	мТипыИнформации[1] = Перечисления.ТипыКонтактнойИнформации.Телефон;
	
	Возврат мТипыИнформации; 	

КонецФункции // ПолучитьТипыКонтактнойИнформации()

//ТекущийОбъект Композиция, ИзделиеКомплект
Функция СотрудникиОбъекта(ТекущийОбъект, ВозвращатьПользователей = Истина) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПустойСотрудник = ?(ВозвращатьПользователей, Справочники.Пользователи.ПустаяСсылка(), Справочники.Сотрудники.ПустаяСсылка());
	
	стСотрудники = Новый Структура("Конструктор, Менеджер, ВедущийКонструктор, Дизайнер, Замерщик"
		, ПустойСотрудник, ПустойСотрудник, ПустойСотрудник, ПустойСотрудник, ПустойСотрудник);
	
	СотрудникиКомплекты(ТекущийОбъект, стСотрудники);
	
	Если ВозвращатьПользователей Тогда
		
		мСотрудники = Новый Массив;
		
		Если ЗначениеЗаполнено(стСотрудники.Замерщик) Тогда
			мСотрудники.Добавить(стСотрудники.Замерщик);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(стСотрудники.Конструктор) Тогда
			мСотрудники.Добавить(стСотрудники.Конструктор);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(стСотрудники.Менеджер) Тогда
			мСотрудники.Добавить(стСотрудники.Менеджер);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(стСотрудники.ВедущийКонструктор) Тогда
			мСотрудники.Добавить(стСотрудники.ВедущийКонструктор);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(стСотрудники.Дизайнер) Тогда
			мСотрудники.Добавить(стСотрудники.Дизайнер);
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Пользователи.Сотрудник КАК Сотрудник,
			|	Пользователи.Ссылка КАК Пользователь
			|ИЗ
			|	Справочник.Пользователи КАК Пользователи
			|ГДЕ
			|	Пользователи.Сотрудник В(&мСотрудники)";
		
		Запрос.УстановитьПараметр("мСотрудники", мСотрудники);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Для каждого текЭлемент Из стСотрудники Цикл
				
				Если текЭлемент.Значение = Выборка.Сотрудник Тогда
					
					стСотрудники[текЭлемент.Ключ] = Выборка.Пользователь;
					Прервать;
					
				КонецЕсли;	
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат стСотрудники;
	
КонецФункции // СотрудникиОбъекта()

Функция СотрудникиКомплекты(Комплект, стСотрудники)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ДанныеКомплектаСрезПоследних.Конструктор, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК Конструктор,
	|	ИзделияКомплект.Проект.ВедущийКонструктор КАК ВедущийКонструктор,
	|	ИзделияКомплект.Проект.Дизайнер КАК Дизайнер,
	|	ИзделияКомплект.Проект.Менеджер КАК Менеджер,
	|	ИзделияКомплект.Проект.Замерщик КАК Замерщик
	|ИЗ
	|	Справочник.ИзделияКомплект КАК ИзделияКомплект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект = &Комплект) КАК ДанныеКомплектаСрезПоследних
	|		ПО (ДанныеКомплектаСрезПоследних.Комплект = ИзделияКомплект.Ссылка)
	|ГДЕ
	|	ИзделияКомплект.Ссылка = &Комплект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИзменениеСотрудникаСрезПоследних.Менеджер КАК Менеджер,
	|	ИзменениеСотрудникаСрезПоследних.ВедущийКонструктор КАК ВедущийКонструктор,
	|	ИзменениеСотрудникаСрезПоследних.Дизайнер КАК Дизайнер
	|ИЗ
	|	РегистрСведений.ИзменениеСотрудника.СрезПоследних(, ОбъектИзменения = &Комплект) КАК ИзменениеСотрудникаСрезПоследних";
	
	Запрос.УстановитьПараметр("Комплект", Комплект);
	
	Если ТипЗнч(Комплект) = Тип("СправочникСсылка.Композиции") Тогда
	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Справочник.ИзделияКомплект", "Справочник.Композиции");	
	
	КонецЕсли;
	
	Результат 	= Запрос.ВыполнитьПакет();
	Выборка 	= Результат[0].Выбрать();
	тз 			= Результат[1].Выгрузить();
	
	Пока Выборка.Следующий() Цикл
		
		Если тз.Количество() = 0 Тогда
			
			стСотрудники.Конструктор 		= Выборка.Конструктор;
			стСотрудники.ВедущийКонструктор	= Выборка.ВедущийКонструктор;
			стСотрудники.Менеджер 			= Выборка.Менеджер;
			стСотрудники.Дизайнер 			= Выборка.Дизайнер;
			стСотрудники.Замерщик 			= Выборка.Замерщик;
			
		Иначе
			
			стСотрудники.ВедущийКонструктор	= ?(ЗначениеЗаполнено(тз[0].ВедущийКонструктор), 	тз[0].ВедущийКонструктор, 		Выборка.ВедущийКонструктор);
			стСотрудники.Менеджер 			= ?(ЗначениеЗаполнено(тз[0].Менеджер), 				тз[0].Менеджер, 				Выборка.Менеджер);
			стСотрудники.Дизайнер 			= ?(ЗначениеЗаполнено(тз[0].Дизайнер), 				тз[0].Дизайнер, 				Выборка.Дизайнер);
			стСотрудники.Замерщик 			= Выборка.Замерщик;
			стСотрудники.Конструктор 		= Выборка.Конструктор;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат стСотрудники;
	
КонецФункции // СотрудникиКомпозиции(ТекущийОбъект, стСотрудники)

Функция ПолучитьКонструктораРазработки(Задача) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеКомплекта.Конструктор КАК Конструктор
	|ИЗ
	|	Задача.Задачи_ПКД КАК Задачи_ПКД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплекта
	|		ПО Задачи_ПКД.ОбъектТЗ = ДанныеКомплекта.Комплект
	|ГДЕ
	|	Задачи_ПКД.Ссылка = &Задача";
	
	Если ТипЗнч(Задача) = Тип("ЗадачаСсылка.Задачи_РКД") Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Задачи_ПКД", "Задачи_РКД");	
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Задача", Задача);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат омСотрудники.ПолучитьПользователяПоСотруднтку(Выборка.Конструктор);
	КонецЦикла;
	
	Возврат Справочники.Пользователи.ПустаяСсылка();
	
КонецФункции // ПолучитьКонструктораРазработки()

Функция ПолучитьКонструктораРазработкиЗадач(мЗадачи) Экспорт
	
	Если НЕ ТипЗнч(мЗадачи) = Тип("Массив") Тогда
	
		Возврат Новый ТаблицаЗначений;	
	
	КонецЕсли;
	
	Если мЗадачи.Количество() = 0 Тогда
	
		Возврат Новый ТаблицаЗначений;	
	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеКомплекта.Конструктор КАК Конструктор,
		|	Задачи_ПКД.Ссылка КАК Задача
		|ИЗ
		|	Задача.Задачи_ПКД КАК Задачи_ПКД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта КАК ДанныеКомплекта
		|		ПО Задачи_ПКД.ОбъектТЗ = ДанныеКомплекта.Комплект
		|ГДЕ
		|	Задачи_ПКД.Ссылка В(&мЗадачи)";
	
	Если ТипЗнч(мЗадачи[0]) = Тип("ЗадачаСсылка.Задачи_РКД") Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Задачи_ПКД", "Задачи_РКД");	
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("мЗадачи", мЗадачи);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьКонструктораРазработкиЗадач(Задачи)

Функция ПолучитьСотруднткаПоПользователю(Пользователь) Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Пользователи.Сотрудник КАК Сотрудник
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Ссылка = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Сотрудник;
	КонецЦикла;
	
	
КонецФункции // ПолучитьПользователяПоСотруднику()

Функция ПолучитьПользователяПоСотруднтку(Сотрудник) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Сотрудник) Тогда
		
		Возврат Справочники.Пользователи.ПустаяСсылка();	
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
	
КонецФункции // ПолучитьПользователяПоСотруднтку(Сотрудник)

Функция ПолучитьИсполнителяОбъекта(ОбъектАдресации, ДолжностьИсполнителя, ВозвращатьПользователей = Истина) Экспорт

	ПустойСотрудник = ?(ВозвращатьПользователей, Справочники.Пользователи.ПустаяСсылка(), Справочники.Сотрудники.ПустаяСсылка());
	Если  ПустаяСтрока(ДолжностьИсполнителя) ИЛИ ДолжностьИсполнителя = "Нет" ИЛИ НЕ ЗначениеЗаполнено(ОбъектАдресации) Тогда
		Возврат ПустойСотрудник;
	КонецЕсли;
	
	ТипОбъекта 		= ТипЗнч(ОбъектАдресации);
	ТекущийПроект	= Справочники.Проекты.ПустаяСсылка();
	
	Если ТипОбъекта = Тип("СправочникСсылка.ИзделияКомплект")
		ИЛИ ТипОбъекта = Тип("СправочникСсылка.Композиции") 
		ИЛИ ТипОбъекта = Тип("ЗадачаСсылка.Задачи_ПКД") 
		ИЛИ ТипОбъекта = Тип("ЗадачаСсылка.Задачи_РКД") Тогда 
		
		Если ТипОбъекта = Тип("ЗадачаСсылка.Задачи_ПКД") 
		ИЛИ ТипОбъекта = Тип("ЗадачаСсылка.Задачи_РКД") Тогда
			СтруктураДанных = СотрудникиОбъекта(ОбъектАдресации.ОбъектТЗ, ВозвращатьПользователей);
		Иначе
			СтруктураДанных = СотрудникиОбъекта(ОбъектАдресации, ВозвращатьПользователей);
		КонецЕсли;
	
		
		Если ДолжностьИсполнителя = "Конструктор" Тогда
			Возврат СтруктураДанных.Конструктор; 
		ИначеЕсли ДолжностьИсполнителя = "Дизайнер" Тогда
			Возврат СтруктураДанных.Дизайнер;
		ИначеЕсли ДолжностьИсполнителя = "Менеджер" Тогда
			Возврат СтруктураДанных.Менеджер;
		ИначеЕсли ДолжностьИсполнителя = "Замерщик" Тогда
			Возврат СтруктураДанных.Замерщик;
		ИначеЕсли ДолжностьИсполнителя = "Ведущий конструктор" Тогда
			Возврат СтруктураДанных.ВедущийКонструктор;
		Иначе
			Возврат ПустойСотрудник;
		КонецЕсли;
	
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.Проекты") Тогда
		ТекущийПроект = ОбъектАдресации;
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.Помещения")
		ИЛИ ТипОбъекта = Тип("СправочникСсылка.ИзделияЗаказчика")Тогда
		ТекущийПроект = ОбъектАдресации.Проект;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ТекущийПроект) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА &ДолжностьИсполнителя = ""Менеджер""
			|			ТОГДА Проекты.Менеджер
			|		КОГДА &ДолжностьИсполнителя = ""Дизайнер""
			|			ТОГДА Проекты.Дизайнер
			|		КОГДА &ДолжностьИсполнителя = ""Замерщик""
			|			ТОГДА Проекты.Замерщик
			|		КОГДА &ДолжностьИсполнителя = ""Ведущий конструктор""
			|			ТОГДА Проекты.ВедущийКонструктор
			|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|	КОНЕЦ КАК Сотрудник
			|ПОМЕСТИТЬ втСотрудник
			|ИЗ
			|	Справочник.Проекты КАК Проекты
			|ГДЕ
			|	Проекты.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	втСотрудник.Сотрудник КАК Сотрудник,
			|	ЕСТЬNULL(Пользователи.Ссылка, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК Пользователь
			|ИЗ
			|	втСотрудник КАК втСотрудник
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
			|		ПО втСотрудник.Сотрудник = Пользователи.Сотрудник
			|			И (НЕ втСотрудник.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка))";
		
		Запрос.УстановитьПараметр("Ссылка", ТекущийПроект);
		Запрос.УстановитьПараметр("ДолжностьИсполнителя", ДолжностьИсполнителя);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Возврат ?(ВозвращатьПользователей, Выборка.Пользователь, Выборка.Сотрудник);
			
		КонецЦикла;
		
	КонецЕсли;
	
    Возврат ПустойСотрудник;
	
КонецФункции // ПолучитьМсолнителяОбъекта()

Функция ПолучитьРабочееВремяСотрудников(мСотрудники, ВозвратМассивом = Истина) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Сотрудник,
		|	Сотрудники.НачалаПерерыва КАК НачалаПерерыва,
		|	Сотрудники.НачалаРабочегоДня КАК НачалаРабочегоДня,
		|	Сотрудники.ОкончаниеПерерыва КАК ОкончаниеПерерыва,
		|	Сотрудники.ОкончаниеРабочегоДня КАК ОкончаниеРабочегоДня
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Ссылка В(&Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НастройкиПроекта.ИмяНастройки КАК ИмяНастройки,
		|	НастройкиПроекта.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки В(&ИмяНастройки)
		|	И НастройкиПроекта.НомерНастройки = 0
		|	И НастройкиПроекта.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Ссылка", мСотрудники);
	
	Возврат ЗаполнитьТаблицуРабочееВремя(Запрос, Истина, ВозвратМассивом);
	

КонецФункции // ПолучитьРабочиеВремяСотрудников()

Функция ПолучитьРабочееВремяПользователи(мПользователи, ВозвратМассивом = Истина) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.НачалаПерерыва КАК НачалаПерерыва,
		|	Сотрудники.НачалаРабочегоДня КАК НачалаРабочегоДня,
		|	Сотрудники.ОкончаниеПерерыва КАК ОкончаниеПерерыва,
		|	Сотрудники.ОкончаниеРабочегоДня КАК ОкончаниеРабочегоДня,
		|	Пользователи.Ссылка КАК Пользователь
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
		|		ПО Пользователи.Сотрудник = Сотрудники.Ссылка
		|ГДЕ
		|	Пользователи.Ссылка В (&Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НастройкиПроекта.ИмяНастройки КАК ИмяНастройки,
		|	НастройкиПроекта.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки В(&ИмяНастройки)
		|	И НастройкиПроекта.НомерНастройки = 0
		|	И НастройкиПроекта.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Ссылка", мПользователи);
	
	Возврат ЗаполнитьТаблицуРабочееВремя(Запрос, Ложь, ВозвратМассивом);

КонецФункции // ПолучитьРабочиеВремяСотрудников()

Функция ЗаполнитьТаблицуРабочееВремя(Запрос, Сотрудник, ВозвратМассивом)

	ОбъектНастроек = Отчеты.ОбщиеНастройки.Создать();
	
	ИменаНастроек = Новый Массив(4);
	ИменаНастроек[0] = ОбъектНастроек.ПолучитьНачалаРабочегоДня();
	ИменаНастроек[1] = ОбъектНастроек.ПолучитьОкончаниеРабочегоДня();
	ИменаНастроек[2] = ОбъектНастроек.ПолучитьНачалаПерерыва();
	ИменаНастроек[3] = ОбъектНастроек.ПолучитьОкончаниеПерерыва();
	
	Запрос.УстановитьПараметр("ИмяНастройки", 	ИменаНастроек);
	Результат = Запрос.ВыполнитьПакет();
	
	ПустаяДата = Дата(1, 1, 1);
	ВремяПоУмолчанию = Новый Структура("НачалаПерерыва, НачалаРабочегоДня, ОкончаниеПерерыва, ОкончаниеРабочегоДня"
							, ПустаяДата
							, ПустаяДата
							, ПустаяДата);
	
	Выборка = Результат[1].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ИмяНастройки = ИменаНастроек[0] Тогда
			ВремяПоУмолчанию.НачалаРабочегоДня = Выборка.Значение;	
		ИначеЕсли Выборка.ИмяНастройки = ИменаНастроек[1] Тогда
			ВремяПоУмолчанию.ОкончаниеРабочегоДня = Выборка.Значение;	
		ИначеЕсли Выборка.ИмяНастройки = ИменаНастроек[2] Тогда
			ВремяПоУмолчанию.НачалаПерерыва = Выборка.Значение;	
		ИначеЕсли Выборка.ИмяНастройки = ИменаНастроек[3] Тогда
			ВремяПоУмолчанию.ОкончаниеПерерыва = Выборка.Значение;	
		КонецЕсли;
	КонецЦикла;

	КвалификаторыДаты = Новый КвалификаторыДаты(ЧастиДаты.Время);
    ОписаниеВремя = Новый ОписаниеТипов("Дата", , , , ,КвалификаторыДаты);    
 
	РабочиеВремя = Новый ТаблицаЗначений;
	Если Сотрудник Тогда
		РабочиеВремя.Колонки.Добавить("Сотрудник", 		Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	Иначе
		РабочиеВремя.Колонки.Добавить("Пользователь", 	Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	КонецЕсли;
	РабочиеВремя.Колонки.Добавить("НачалаПерерыва", 		ОписаниеВремя);
	РабочиеВремя.Колонки.Добавить("НачалаРабочегоДня", 		ОписаниеВремя);
	РабочиеВремя.Колонки.Добавить("ОкончаниеПерерыва", 		ОписаниеВремя);
	РабочиеВремя.Колонки.Добавить("ОкончаниеРабочегоДня", 	ОписаниеВремя);
	
	Выборка = Результат[0].Выбрать();
	Пока Выборка.Следующий() Цикл
		НС = РабочиеВремя.Добавить();
		
		ЗаполнитьЗначенияСвойств(НС, Выборка);
		НС.НачалаПерерыва 		= ?(НС.НачалаПерерыва 			= ПустаяДата, ВремяПоУмолчанию.НачалаПерерыва, 			НС.НачалаПерерыва); 
		НС.НачалаРабочегоДня 	= ?(НС.НачалаРабочегоДня 		= ПустаяДата, ВремяПоУмолчанию.НачалаРабочегоДня, 		НС.НачалаРабочегоДня); 
		НС.ОкончаниеПерерыва 	= ?(НС.ОкончаниеПерерыва 		= ПустаяДата, ВремяПоУмолчанию.ОкончаниеПерерыва, 		НС.ОкончаниеПерерыва); 
		НС.ОкончаниеРабочегоДня = ?(НС.ОкончаниеРабочегоДня 	= ПустаяДата, ВремяПоУмолчанию.ОкончаниеРабочегоДня, 	НС.ОкончаниеРабочегоДня); 
	КонецЦикла;
	
	Возврат ?(ВозвратМассивом, ОбщегоНазначения.ТаблицаЗначенийВМассив(РабочиеВремя), РабочиеВремя);

КонецФункции // ЗаполнитьТаблицуРабочееВремя()

 Функция ЗаполнитьСписокСотрудниковПоДолжностям(ТолькоРаботающие, ВозвращатьПользователей = Ложь, Должность = Неопределено) Экспорт

	СоответствиеСотрудниковПоДолжностям = Новый Соответствие;
	
	СоответствиеСотрудниковПоДолжностям.Вставить(Перечисления.Должности.ПустаяСсылка(), Новый Массив);	
	Если ЗначениеЗаполнено(Должность) Тогда
		СоответствиеСотрудниковПоДолжностям.Вставить(Должность, Новый Массив);	
	Иначе
		Для каждого х Из Перечисления.Должности Цикл
			СоответствиеСотрудниковПоДолжностям.Вставить(х, Новый Массив);	
		КонецЦикла;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Сотрудник,
		|	Сотрудники.Должность КАК Должность,
		|	Сотрудники.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПриемНаРаботу.СрезПоследних КАК ПриемНаРаботуСрезПоследних
		|		ПО (ПриемНаРаботуСрезПоследних.Сотрудник = Сотрудники.Ссылка)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &Должность = НЕОПРЕДЕЛЕНО
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ Сотрудники.Должность = &Должность 
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &ТолькоРаботающие
		|				ТОГДА ЕСТЬNULL(ПриемНаРаботуСрезПоследних.Работает, ЛОЖЬ)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И НЕ Сотрудники.ВАрхиве
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
	
	
	Запрос.УстановитьПараметр("ТолькоРаботающие", 	ТолькоРаботающие);
	Запрос.УстановитьПараметр("Должность", 			?(ЗначениеЗаполнено(Должность), Должность, Неопределено));
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если ВозвращатьПользователей Тогда
	
		МассивСотрудников = Новый Массив;
	
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		
		ДанныеСотрудника = Новый Структура("Наименование, Фамилия, Сотрудник", "", "");
		ЗаполнитьЗначенияСвойств(ДанныеСотрудника, Выборка); 
		СоответствиеСотрудниковПоДолжностям.Получить(Выборка.Должность).Добавить(ДанныеСотрудника);	
		
		Если ВозвращатьПользователей Тогда
			МассивСотрудников.Добавить(Выборка.Сотрудник); 	
		КонецЕсли;
		
	КонецЦикла;
	
	Если ВозвращатьПользователей Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Пользователи.Сотрудник КАК Сотрудник,
			|	Пользователи.Ссылка КАК Пользователь,
			|	Пользователи.Наименование КАК Наименование
			|ИЗ
			|	Справочник.Пользователи КАК Пользователи
			|ГДЕ
			|	Пользователи.Сотрудник В(&МассивСотрудников)";
		
		Запрос.УстановитьПараметр("МассивСотрудников", МассивСотрудников);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			МассивСотрудников.Удалить(МассивСотрудников.Найти(Выборка.Сотрудник));
			
			Для каждого Элемент Из СоответствиеСотрудниковПоДолжностям Цикл
			
				Для каждого ДанныеСотрудника Из Элемент.Значение Цикл
				
					Если ДанныеСотрудника.Сотрудник = Выборка.Сотрудник Тогда
					
						ДанныеСотрудника.Сотрудник 		= Выборка.Пользователь;
						ДанныеСотрудника.Наименование 	= Выборка.Наименование;
						
					КонецЕсли;	
				
				КонецЦикла;	        
			
			КонецЦикла;
			
		КонецЦикла; 
		
		Для каждого х Из МассивСотрудников Цикл
		
			Для каждого Элемент Из СоответствиеСотрудниковПоДолжностям Цикл
			
				Для каждого ДанныеСотрудника Из Элемент.Значение Цикл
				
					Если ДанныеСотрудника.Сотрудник = х Тогда
					
						ДанныеСотрудника.Сотрудник 		= Справочники.Пользователи.ПустаяСсылка();
						ДанныеСотрудника.Наименование 	= "";
						
					КонецЕсли;	
				
				КонецЦикла;	        
			
			КонецЦикла;
		
		КонецЦикла;
		
	КонецЕсли;

	
    Возврат СоответствиеСотрудниковПоДолжностям;
	
КонецФункции // ЗаполнитьСписокСотрудниковПоДолжностям(ТолькоРаботающие)

Функция ДолжностьСотрудника(Сотрудник) Экспорт

	Возврат ?(ЗначениеЗаполнено(Сотрудник), Сотрудник.Должность, Перечисления.Должности.ПустаяСсылка());	

КонецФункции // ДолжностьСотрудника()

Функция ДолжностьПользователя(Пользователь) Экспорт
	
	Должность = Перечисления.Должности.ПустаяСсылка(); 
	
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
	
		Возврат Должность;	
	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(Пользователи.Сотрудник.Должность, ЗНАЧЕНИЕ(Перечисление.Должности.ПустаяСсылка)) КАК Должность
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Ссылка = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
    	Должность = Выборка.Должность;
	КонецЦикла;
	
	Возврат Должность;

КонецФункции // ДолжностьСотрудника(Пользователь)

Функция ПолучитьКонструкторовПоВедущемуКонструкторуПользователь(ВедущийКонструктор, ВозвратСотрудников = Ложь) Экспорт

	Если НЕ ЗначениеЗаполнено(ВедущийКонструктор) Тогда
		Возврат Новый СписокЗначений;	
	КонецЕсли;
	
	СотрудникВедущийКонструктор = ВедущийКонструктор.Сотрудник;
	
	Возврат ПолучитьКонструкторовПоВедущемуКонструкторуСотрудник(СотрудникВедущийКонструктор, ВозвратСотрудников); 
	
КонецФункции // ПолучитьКострукторовПоВедущемуКонстр()

Функция ПолучитьКонструкторовПоВедущемуКонструкторуСотрудник(ВедущийКонструктор, ВозвратСотрудников = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодразделенияСрезПоследних.Подразделение КАК Подразделение,
		|	ПодразделенияСрезПоследних1.Сотрудник КАК Сотрудник,
		|	ПодразделенияСрезПоследних1.Сотрудник.Наименование КАК СотрудникНаименование
		|ИЗ
		|	РегистрСведений.Подразделения.СрезПоследних(
		|			,
		|			Сотрудник = &Сотрудник
		|				И НомерСтрокиТаблицы = 1) КАК ПодразделенияСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Подразделения.СрезПоследних(, ) КАК ПодразделенияСрезПоследних1
		|		ПО ПодразделенияСрезПоследних.Подразделение = ПодразделенияСрезПоследних1.Подразделение
		|ГДЕ
		|	ПодразделенияСрезПоследних1.НомерСтрокиТаблицы = 1
		|	И ПодразделенияСрезПоследних1.Сотрудник.Должность = ЗНАЧЕНИЕ(Перечисление.Должности.Конструктор)
		|
		|УПОРЯДОЧИТЬ ПО
		|	СотрудникНаименование";
	
	Запрос.УстановитьПараметр("Сотрудник", ВедущийКонструктор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СтруктураВозврата = Новый Структура("Подразделение, СписокСотрудников", 
										Справочники.Подразделения.ПустаяСсылка(),
										Новый СписокЗначений);
										
	ПервоеЗначение = Истина;
	
	Пока Выборка.Следующий() Цикл
		
		Если ПервоеЗначение Тогда
			СтруктураВозврата.Подразделение = Выборка.Подразделение;
			ПервоеЗначение = Ложь;  
		КонецЕсли;
		
		СтруктураВозврата.СписокСотрудников.Добавить(Выборка.Сотрудник, Выборка.СотрудникНаименование);
		
	КонецЦикла;
	
	Если НЕ ВозвратСотрудников Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Пользователи.Наименование КАК ПользовательНаименование,
			|	Пользователи.Ссылка КАК Пользователь
			|ИЗ
			|	Справочник.Пользователи КАК Пользователи
			|ГДЕ
			|	Пользователи.Сотрудник В(&Сотрудник)";
			
		Запрос.УстановитьПараметр("Сотрудник", СтруктураВозврата.СписокСотрудников);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		СтруктураВозврата.СписокСотрудников.Очистить();
		
		Пока Выборка.Следующий() Цикл
			СтруктураВозврата.СписокСотрудников.Добавить(Выборка.Пользователь, Выборка.ПользовательНаименование);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции // ПолучитьКострукторовПоВедущемуКонстр()
